cf/Catalogs/EDIProfiles.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>EDIProfiles</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SenderTagEInvoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseEInvoice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EInvoiceStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDocumentScenario</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDocumentScenario</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>BankInfo</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Bank</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDocumentScenario</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDocumentScenario</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Counterparty</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DocumentPrefixes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Prefix</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Owner</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDocumentType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDocumentType</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DocumentsForExchange</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDocumentType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDocumentType</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XSLT</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.XSLT</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Hosts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>UseTest</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Provider</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDIProviders</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>URL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UserName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Password</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>URLTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HostTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UserNameTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PasswordTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/EDIProfiles/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel)
	
	If CheckCompany() And Not DeletionMark Then
		MessageText = NStr("en = '%1 is already has EDI Profile.'; tr = '%1 zaten EDI profiline sahip.'");
		MessageText = StringFunctionsClientServer.SubstituteParametersToString(MessageText, Company);
		CommonClientServer.MessageToUser(MessageText,,,, Cancel);
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	For Each Host In Hosts Do
		
		If Host.UseTest Then
			CheckedAttributes.Add("Hosts.URLTest");
			CheckedAttributes.Add("Hosts.UserNameTest");
			CheckedAttributes.Add("Hosts.PasswordTest");
		Else
			CheckedAttributes.Add("Hosts.URL");
			CheckedAttributes.Add("Hosts.UserName");
			CheckedAttributes.Add("Hosts.Password");
		EndIf;
		
	EndDo;
	
EndProcedure

Procedure OnCopy(CopiedObject)
	
	For Each Host In Hosts Do
		
		NewUUID = New UUID;
		
		Filter = New Structure("SourceID", Host.LineID);
		ConnectedLines = DocumentsForExchange.FindRows(Filter);
		
		For Each Line In ConnectedLines Do
			Line.SourceID = NewUUID;
		EndDo;
		
		Host.LineID = NewUUID;
		
	EndDo;
	
EndProcedure

#EndRegion

#Region Private

Function CheckCompany()
	
	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED TOP 1
	|	EDIProfiles.Ref AS Ref
	|FROM
	|	Catalog.EDIProfiles AS EDIProfiles
	|WHERE
	|	EDIProfiles.Company = &Company
	|	AND EDIProfiles.Ref <> &Ref
	|	AND NOT EDIProfiles.DeletionMark";
	
	Query.SetParameter("Company", Company);
	Query.SetParameter("Ref", Ref);
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

#EndRegion

#EndIf
